<template>
  <v-sheet id="about" class="py-16 text-center" color="secondary">
    <div class="text-h4 font-weight-bold">Про нас</div>

    <div
      class="text-body-1 font-weight-regular mt-3 text-medium-emphasis mb-12 pa-14"
    >
    Ми - команда досвідчених фахівців, які знають все про ремонт автомобільних дзеркал. Наші майстри мають багаторічний стаж роботи та володіють всіма необхідними навичками для відновлення дзеркал будь-якої складності. Ми працюємо з різними марками та моделями автомобілів, тому можемо гарантувати якісний ремонт вашого дзеркала незалежно від його типу та виробника. Наші фахівці постійно підвищують свою кваліфікацію та стежать за новітніми технологіями в сфері ремонту дзеркал, щоб завжди бути на крок попереду та надавати вам найкращий сервіс.

Звертаючись до нас, ви можете розраховувати на індивідуальний підхід та професійну консультацію. Ми завжди готові відповісти на ваші питання та допомогти з вибором оптимального варіанту ремонту. Наша мета - зробити ремонт вашого дзеркала максимально комфортним та вигідним для вас. Ми пропонуємо широкий спектр послуг, від заміни дзеркального елемента до відновлення корпусу дзеркала.

Ми цінуємо кожного клієнта та прагнемо забезпечити йому найкращий сервіс. Тому ми завжди йдемо назустріч побажанням клієнтів та пропонуємо гнучку систему знижок. Зверніться до нас, і ваше дзеркало знову буде радувати вас своїм бездоганним виглядом!
    </div>

    <v-container>
      <v-row>
        <v-col
          v-for="item in whatWeDo"
          :key="item.title"
          class="d-flex flex-column align-center"
          cols="12"
          md="4"
        >
          <img :src="item.icon" class="w-75 h-50" />

          <div class="text-h6 mt-1">
            {{ item.title }}
          </div>

          <div class="text-body-1 mt-2 text-medium-emphasis w-75">
            {{ item.description }}
          </div>
        </v-col>
      </v-row>
    </v-container>
  </v-sheet>
</template>

<script setup>
const whatWeDo = [
  {
    icon: 'src/assets/what/scratch.png',
    title: 'Полірування та видалення подряпин',
    description:
      'Надаємо дзеркалам нового вигляду, усуваючи подряпини та потертості.',
  },
  {
    icon: 'src/assets/what/crack.png',
    title: 'Ремонт тріщин і відколів',
    description:
      'Відновлюємо пошкоджені дзеркала, щоб уникнути дорогої заміни.',
  },
  {
    icon: 'src/assets/what/antiglare.png',
    title: 'Антивідблискове покриття',
    description:
      'Захищаємо дзеркала від сонячних відблисків для комфортного водіння.',
  },
];
</script>
